#+TITLE: Let's Build an Interpreter

Interpreter Tutorial after:
https://ruslanspivak.com/lsbasi-part1/

** Interactive Test:
#+BEGIN_SRC python
from interpreter import PropInterpreter, Lexer
text = "1d20 + 5 >= 20"
return PropInterpreter(Lexer(text)).expr()
#+END_SRC

#+RESULTS:
| True | : | 0.3 | False | : | 0.7 |

